from pathlib import Path
from piexif import load

# 基本流程
# 获取图片信息 - 将图片扩展 - 在扩展的白框上添加水印 - 保存输出


# ---数据对照表---
# | 标签        | 字段名              | 含义                                                            |
# | --------- | ---------------- | ------------------------------------------------------------- |
# | **271**   | `Make`           | 相机制造商 → **NIKON CORPORATION**                                 |
# | **272**   | `Model`          | 相机型号 → **NIKON Z 50**                                         |
# | **282**   | `XResolution`    | 水平分辨率 → 240 dpi                                               |
# | **283**   | `YResolution`    | 垂直分辨率 → 240 dpi                                               |
# | **296**   | `ResolutionUnit` | 分辨率单位 → `2` 表示 **英寸**                                         |
# | **305**   | `Software`       | 后期处理软件 → **Adobe Photoshop Lightroom Classic 11.1 (Windows)** |
# | **306**   | `DateTime`       | 文件最后修改时间 → **2024:05:01 22:34:25**                            |
# | **315**   | `Artist`         | 摄影师或创作者 → **Crist\_Y**                                        |
# | **33432** | `Copyright`      | 版权信息 → **CRISTYANG**                                          |
# | **34665** | `ExifIFDPointer` | 指向更多 EXIF 数据的偏移量（内部使用）                                        |
# | 键名            | 全称                      | 内容说明                                |
# | ------------- | ----------------------- | ----------------------------------- |
# | **0th**       | Image IFD（0th IFD）      | 主图像的基本信息，如相机型号、艺术家、版权等。             |
# | **Exif**      | Exif IFD                | 拍照参数，如曝光时间、ISO、光圈、焦距、白平衡等。          |
# | **GPS**       | GPS IFD                 | GPS 信息，如经纬度、海拔、拍摄方向等。               |
# | **Interop**   | Interoperability IFD    | 与 **Exif** 相关的兼容性数据，通常用于特殊格式或设备间交换。 |
# | **1st**       | 1st IFD / Thumbnail IFD | 缩略图的基本信息，如缩略图尺寸、压缩方式等。              |
# | **thumbnail** | 缩略图二进制数据                | 真正的 JPEG 缩略图字节流，可直接保存为 `.jpg` 文件。   |
# --------------------------- exif ---------------------------
# | 标签编号      | 含义                       | 值           | 解释                 |
# | --------- | ------------------------ | ----------- | ------------------ |
# | **33434** | 曝光时间（ExposureTime）       | `(1, 4000)` | 1/4000 秒（非常快的快门速度） |
# | **33437** | 光圈值（FNumber）             | `(45, 10)`  | 4.5（即 f/4.5）       |
# | **34850** | 曝光程序（ExposureProgram）    | `1`         | 手动模式（Manual）       |
# | **34855** | ISO 感光度（ISOSpeedRatings） | `640`       | ISO 640            |
# | **34864** | 感光度类型                    | `2`         | 标准 ISO 感光度         |
# | **34866** | 推荐曝光指数                   | `640`       | 与 ISO 一致           |
# | 标签编号            | 含义                       | 值                        | 解释                     |
# | --------------- | ------------------------ | ------------------------ | ---------------------- |
# | **36867**       | 原始拍摄时间（DateTimeOriginal） | `b'2024:05:01 14:27:43'` | 拍摄于 2024年5月1日 14:27:43 |
# | **36868**       | 数字化时间（DateTimeDigitized） | 同上                       | 通常与拍摄时间一致              |
# | **36880~36882** | 时区偏移（OffsetTime\*）       | `b'+08:00'`              | 东八区（中国标准时间）            |
# | 标签编号      | 含义                      | 值                     | 解释                     |
# | --------- | ----------------------- | --------------------- | ---------------------- |
# | **37377** | 快门速度（ShutterSpeedValue） | `(11965784, 1000000)` | 约 1/4000 秒（与 33434 一致） |
# | **37378** | 光圈值（ApertureValue）      | `(433985, 100000)`    | 约 f/4.5（与 33437 一致）    |
# | **37380** | 曝光补偿（ExposureBias）      | `(0, 6)`              | 0 EV（无补偿）              |
# | **37383** | 测光模式（MeteringMode）      | `5`                   | 矩阵测光（Pattern）          |
# | **37384** | 光源类型（LightSource）       | `9`                   | 闪光灯                    |
# | **37385** | 闪光灯状态（Flash）            | `16`                  | 闪光灯未闪光（或强制关闭）          |
# | **37386** | 焦距（FocalLength）         | `(160, 10)`           | 16.0 mm（广角端）           |
# | 标签编号      | 含义                      | 值                                                | 解释                |
# | --------- | ----------------------- | ------------------------------------------------ | ----------------- |
# | **42033** | 相机序列号（BodySerialNumber） | `b'7821559'`                                     | Nikon 相机机身编号      |
# | **42034** | 镜头规格（LensSpecification） | `((160, 10), (500, 10), (350, 100), (630, 100))` | 16-50mm，f/3.5-6.3 |
# | **42035** | 镜头制造商（LensMake）         | `b'NIKON'`                                       | Nikon             |
# | **42036** | 镜头型号（LensModel）         | `b'NIKKOR Z DX 16-50mm f/3.5-6.3 VR'`            | 具体镜头型号            |
# | **42037** | 镜头序列号（LensSerialNumber） | `b'20205168'`                                    | 镜头编号              |

fix = '../imgs'
image_path = Path(fix + '/input')

def get_photo_info(image_path: Path):
    # 将图片所有元数据转换成字典
    info = load(str(image_path))
    # 提取需要的信息，相机制造商，相机信息，摄影师，拍照参数
    # 相机制造商['0th'['271']]
    make = info['0th'][271]
    # 相机型号['0th'['272']]
    model = info['0th'][272]
    # 摄影师['0th'['315']]
    artist = info['0th'][315]
    # 拍照参数['Exif']
    exif = info['Exif']
    # 曝光时间['Exif'['33434']]
    exposure_time = exif[33434]
    # 光圈值['Exif'['33437']]
    aperture_value = exif[33437]
    # iso['Exif'['34855']]
    iso = exif[34855]
    # 焦距['Exif'['37386']]
    focal_length = exif[37386]
    # 镜头型号['Exif'['42036']]
    lens_model = exif[42036]







if __name__ == '__main__':
    for ext in ('*.jpg', '*.jpeg'):
        for image in image_path.glob(ext):
            try:
                get_photo_info(image)
            except Exception as e:
                print(f'FAIL {image}: {e}')